cases/case5/system/surfRoughGenDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfRoughGenDict;
}

seed		   			123456789;

roughness				0.01;

fractalParam		-1;

smoothing				0.001;

sizeZ						1024;
sizeX						512;

apply						symmetric; // symmetric, synchronous, asymmetric 
